app/controllers/api/greetings_controller.rb

  def greetings
    @greeting = Greeting.order('RANDOM()').first
---
SELECT "greetings".* FROM "greetings" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]